Revit 2027 API
BuiltInFailures.StairRampFailures.RunBottomHigherThanTopFailure Property
 The base elevation for the run is higher than the top elevation for the run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunBottomHigherThanTopFailure { get; }
Public Shared ReadOnly Property RunBottomHigherThanTopFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunBottomHigherThanTopFailure {
	FailureDefinitionId^ get ();
}
static member RunBottomHigherThanTopFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace